---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricRoundingManager.SegmentLengthRoundingMethod
source: html/2689ef37-0b7a-5f2e-fe73-dac3744ead1f.htm
---
# Autodesk.Revit.DB.Structure.FabricRoundingManager.SegmentLengthRoundingMethod Property

Identifies the segment length rounding method

## Syntax (C#)
```csharp
public RoundingMethod SegmentLengthRoundingMethod { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: IsActiveOnElement property is false.